In [1]:
import pandas as pd

Q1

In [2]:
lst=[4,8,15,16,23,42]
se=pd.Series(lst)
print(se)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2

In [3]:
for i in range(10):
    lst.append(input())
    
se=pd.Series(lst)

In [4]:
se

0               4
1               8
2              15
3              16
4              23
5              42
6             sai
7           Hello
8               *
9               -
10             @\
11    afadhaojdfa
12              a
13           1236
14           1458
15          hello
dtype: object

Q3
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [7]:
name=['Alice','Bob','Claire']
age=[25,30,27]
gender=['Female','Male','Female']
data={'Name':name,'Age':age,'Gender':gender}
df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4

In pandas, a DataFrame is a two-dimensional labeled data structure that consists of rows and columns. It can be thought of as a table or spreadsheet-like data structure where data is organized in a tabular format. Each column in a DataFrame represents a variable, and each row represents an observation or data point.

On the other hand, a pandas Series is a one-dimensional labeled array that can hold data of any type. It is similar to a column in a DataFrame but without the column name. A Series can be seen as a single column or a single row in a DataFrame.

In [9]:
#This is a Data frame
print(df)
print('\n\n\n')
#This is a series
lst=[4,8,15,16,23,42]
se=pd.Series(lst)
print(se)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female




0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q5

read_csv()-This function is necessary to read files into pandas

fillna() - This function is used to fill missing values in a DataFrame with a specified value or a method like forward filling or backward filling.

drop() - This function is used to remove rows or columns from a DataFrame based on specified labels or conditions.

groupby() - This function is used to group the data in a DataFrame based on one or more columns and perform operations on each group separately.

merge() - This function is used to combine multiple DataFrames based on a common column or index, similar to a database join operation.

pivot_table() - This function is used to create a spreadsheet-like pivot table from a DataFrame, summarizing the data based on specified columns.

In [14]:
#demonstrating read csv
df=pd.read_csv(r'C:\Users\dsai9\Data Analytics NPTEL\datasets\application_data.csv')
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

Q6

Series: A pandas Series is mutable, which means you can modify its values by assigning new values to specific indices.


DataFrame: Similarly, a pandas DataFrame is mutable, and you can modify its values by assigning new values to specific cells or entire columns.


Panel: On the other hand, the Panel data structure in pandas has been deprecated since version 0.20.0 and has been replaced by the more flexible multi-dimensional DataFrame. Panels were mutable, but they are no longer recommended for use in pandas.

Q7

In example below, name,age,gender which werer lists are converted to series data object and inserting into dataframe using dictionary data structure as shown

In [15]:
name=pd.Series(['Alice','Bob','Claire'])
age=pd.Series([25,30,27])
gender=pd.Series(['Female','Male','Female'])
data={'Name':name,'Age':age,'Gender':gender}
df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female